'''

Здравствуйте, уважаемая Наталья Самойленко!

Вы просто не представляете как я Вам благодарен и какое Вы все-таки полезное дело делаете! И я просто восхищен Вами! Вы мой учитель и вдохновитель! Спасибо Вам огромное!

Я только начинаю обучение по Пайтон (работаю сетевым инженером на данный момент)и чувствую, что с Вами, под вашим руководством  можно достичь неимоверных высот в обучении!

Искал ваш имейл на гитхабе, но не получилось, потому пишу Вам таким способом))

Вопрос у меня такой: Есть ли возможность проверять выполненные задания самому? То есть ответы на задания где-то существуют? Или же обращаться к Вам? Ведь Вы все-таки занятой человек? Спасибо заранее за ответ!

И еще раз множество оваций в ваш адрес! Вы лучший автор и учитель!

С уважением, Вадим.
'''

print('LOVE YOU!')

